package com.wzb.MybatisExercise20240921;

public class MybatisExercise {
    // 在客户端工具中，编写SQL语句，发给MySql数据库管理系统，由数据库管理系统执行SQL语句并返回执行结果
    // 增删改查：返回收到影响的行数
    // 查询：返回结果集（查询的结果）

    // Java后端通过Java程序操作数据库，Java程序操作数据库的主流方式是：Mybatis

    // Mybatis是一个持久层（dao层）的框架，用于简化JDBC的开发
    // JDBC是Java规定的操作数据库的规则
    // 框架：可以理解为是一个半成品的软件，是一套可以重用、通用、软件基础代码模型；通过框架的基础进行开发，更加高效、规范、通用、可扩展

    // Mybatis会将查询结果，用一个实体类封装起来（一行记录对应一个实体类的对象）
    // 注：表中的字段名必须和实体类的属性名一一对应

    // 使用Mybatis的步骤
    // 1.引入Mybatis的相关依赖，配置Mybatis（数据库的连接信息）
    // 2.编写SQL语句（通过注解或.XML文件的方式）


    
}
